{"question": [" What impression does the narrator give of Tom Buchanan when they first meet again in the book?", " What does the passage say about the relationship between Tom Buchanan and Myrtle Wilson?", " What impression is given of Gatsby based on the rumors circulating among his party guests?", " What does the passage describe about Gatsby's parties at his mansion?", " What does the passage reveal about Gatsby's past, including his original name and how he changed it?\n", " What does Daisy do when Tom comes back into the room with gin rickeys?", " What did Daisy initially suggest the group do to escape the heat, before deciding to go to the Plaza Hotel?", " What happened when Michaelis tried to distract George Wilson after Myrtle's death by asking him about going to church?", " What did Michaelis find in the drawer when he opened it at Wilson's request?", " What did Jordan suddenly tell Nick when they shook hands after their phone call?"], "ground_truth": [" The narrator portrays Tom Buchanan as arrogant and aggressive. He describes Tom as having \"shining arrogant eyes\" and gives the impression that Tom is imposing and feels superior to others.", " The passage indicates that Tom Buchanan and Myrtle Wilson are having an affair. Myrtle is described as Tom's \"mistress\" and he takes Nick to meet her in New York. Myrtle fawns over Tom and seems enamored with him, while Tom treats her possessively. However, the affair is hidden from Myrtle's husband George Wilson.", " The passage gives the impression that Gatsby has a mysterious or shady background, with guests speculating that he was a bootlegger, a German spy, or that he killed a man. However, the rumors seem unlikely and contradict each other.", " The passage describes the extravagant, lavish parties Gatsby hosted at his mansion, with various guests including celebrities, socialites, businessmen, and acquaintances. The parties were lively with drinking, dancing, and gossip. \n\nThe guests included people with names like Ferret, the De Jongs, Ernest Lilly, Klipspringer, Gus Waize, Horace O’Donavan, Lester Myer, George Duckweed, Francis Bull, the Chromes, the Backhyssons, the Dennickers, the Corrigans, the Kellehers, the Dewars, the Scullys, S. W. Belcher, the Smirkes, the young Quinns, and Henry L. Palmetto.\n\nBenny McClenahan always arrived with four different girls who seemed identical. The passage portrays the lavish extravagance of Gatsby's parties.", " The passage reveals that Gatsby's original name was James Gatz. He changed his name to Jay Gatsby at the age of 17 when he saw Dan Cody's yacht and rowed out to meet him. This moment marked the beginning of Gatsby's reinvention of himself and his pursuit of wealth.", " When Tom comes back into the room with gin rickeys, Daisy goes over to Gatsby and pulls his face down, kissing him on the mouth.", " Daisy initially suggested they hire five bathrooms and take cold baths.", " When Michaelis asked George Wilson if he belonged to a church or had gotten married in one, George said he didn't belong to any church now and that getting married was a long time ago. This line of questioning broke Wilson's rocking rhythm briefly and he became silent, before the same half-knowing, half-bewildered look returned to his eyes.", " Michaelis found a small, expensive, and apparently new leather and braided silver dog leash in the drawer.", " Jordan suddenly told Nick that he had thrown her over on the telephone when they shook hands."]}